Revit 2027 API
LinePatternElement.GetLinePattern Method
Overload List
Name | Description
GetLinePattern() |  Gets the LinePattern associated to this element.
GetLinePattern(Document, ElementId) |  Gets the LinePattern associated to an element or from a built-in line pattern.
Top
See Also
Reference
LinePatternElement Class
Autodesk.Revit.DB Namespace